# Pandas dataframe set axis

In [2]:
# How to change the indexes and column by means of a single method

In [1]:
import pandas as pd

In [3]:
students = [('Archana',23,'Salem','India'),
           ('Mani',22,'Coimbatore','India'),
            ('Thiru',32,'Los Vegas','US'),
            ('Kalpana',31,'London','UK'),
            ('Sandhiya',21,'Chennai','India')]

In [4]:
students

[('Archana', 23, 'Salem', 'India'),
 ('Mani', 22, 'Coimbatore', 'India'),
 ('Thiru', 32, 'Los Vegas', 'US'),
 ('Kalpana', 31, 'London', 'UK'),
 ('Sandhiya', 21, 'Chennai', 'India')]

In [5]:
data = pd.DataFrame(students)

In [6]:
data

          0   1           2      3
0   Archana  23       Salem  India
1      Mani  22  Coimbatore  India
2     Thiru  32   Los Vegas     US
3   Kalpana  31      London     UK
4  Sandhiya  21     Chennai  India

In [7]:
# To change the index, usual method

In [8]:
data = pd.DataFrame(students, index = ['s1','s2','s3','s4','s5'])

In [9]:
data

           0   1           2      3
s1   Archana  23       Salem  India
s2      Mani  22  Coimbatore  India
s3     Thiru  32   Los Vegas     US
s4   Kalpana  31      London     UK
s5  Sandhiya  21     Chennai  India

# Another method

# <font color='red'> set_axis()

In [11]:
students = [('Archana',23,'Salem','India'),
           ('Mani',22,'Coimbatore','India'),
            ('Thiru',32,'Los Vegas','US'),
            ('Kalpana',31,'London','UK'),
            ('Sandhiya',21,'Chennai','India')]

In [12]:
data = pd.DataFrame(students)

In [13]:
data

          0   1           2      3
0   Archana  23       Salem  India
1      Mani  22  Coimbatore  India
2     Thiru  32   Los Vegas     US
3   Kalpana  31      London     UK
4  Sandhiya  21     Chennai  India

In [15]:
data.set_axis(['s1','s2','s3','s4','s5'], axis = 0) # this is temporary change in dataframe

           0   1           2      3
s1   Archana  23       Salem  India
s2      Mani  22  Coimbatore  India
s3     Thiru  32   Los Vegas     US
s4   Kalpana  31      London     UK
s5  Sandhiya  21     Chennai  India

In [16]:
data

          0   1           2      3
0   Archana  23       Salem  India
1      Mani  22  Coimbatore  India
2     Thiru  32   Los Vegas     US
3   Kalpana  31      London     UK
4  Sandhiya  21     Chennai  India

# To get permanent change

In [17]:
data.set_axis(['s1','s2','s3','s4','s5'], axis = 0, inplace=True)

In [18]:
data

           0   1           2      3
s1   Archana  23       Salem  India
s2      Mani  22  Coimbatore  India
s3     Thiru  32   Los Vegas     US
s4   Kalpana  31      London     UK
s5  Sandhiya  21     Chennai  India

# To change the column name, using set_axis() method

In [19]:
data

           0   1           2      3
s1   Archana  23       Salem  India
s2      Mani  22  Coimbatore  India
s3     Thiru  32   Los Vegas     US
s4   Kalpana  31      London     UK
s5  Sandhiya  21     Chennai  India

In [20]:
data.set_axis(['Name','Age','City','Country'], axis = 1, inplace = True)

In [21]:
data

        Name  Age        City Country
s1   Archana   23       Salem   India
s2      Mani   22  Coimbatore   India
s3     Thiru   32   Los Vegas      US
s4   Kalpana   31      London      UK
s5  Sandhiya   21     Chennai   India